app/Http/Controllers/ProductController.php

select * from `attribute_values` where `attribute_values`.`product_id` in (1)
select * from `attributes` where `attributes`.`id` in (1, 2, 3)
select * from `products`
---
    public function index()
    {
        $products = Product::with('attributeValues.attribute')->get();